HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
// --------------------------------------------------------------------------------------------------------------------
//      ____    ______   _____
//     /  _/___/_  __/  /__  / ____  ____
//     / // __ \/ /       / / / __ \/ __ \  P L A Y G R O U N D
//   _/ // /_/ / /       / /_/ /_/ / /_/ /
//  /___/\____/_/       /____|____/\____/   (c) 2025 Holger Freudenreich under the MIT licence.
//
// --------------------------------------------------------------------------------------------------------------------
// Firmware for ESP8266 and ESP32 Microcontrollers
// --------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------
// Includes
// --------------------------------------------------------------------------------------------------------------------
#include "Defines.hpp"
#include "ConnectionSettings.hpp"
#include <Arduino.h>
#include <ArduinoJson.h>
// #include <pins_arduino.h>
#include <WiFi.h>
#include <list>
#include "pocos/Microcontroller.hpp"
#include "pocos/Topic.hpp"
#include "nvs_flash.h"

#ifdef USE_REST_SERVER
#include <HTTPClient.h>
#include "WebServer.h"
// Web server running on port 80
WebServer webServer(80);
#endif

// Rotary encoder
#ifdef USE_HW040
#include "HW040/HW040Handling.hpp"
#endif

#ifdef USE_STEPPER_MOTOR
#include "StepperMotor.hpp"
IotZoo::StepperMotor *stepperMotor = NULL;
#endif

#ifdef USE_LED_AND_KEY
#include "TM1638.hpp"
IotZoo::TM1638 *tm1638 = NULL;
#endif

#ifdef USE_WS2818
#include "WS2818.hpp"
IotZoo::WS2818 *ws2812 = NULL;
#endif

#ifdef USE_BLE_HEART_RATE_SENSOR
#include "BLEHeartRateReceiver.hpp"
IotZoo::HeartRateMonitor heartRateMonitor;
#endif

#ifdef USE_HC_SR501
#include "HRSR501Handling.hpp"
IotZoo::HRSR501Handling motionDetectorsHrsc501Handling;
#endif

#ifdef ARDUINO_ESP32_DEV
#include "Settings.hpp"
using namespace IotZoo;
Settings *settings = NULL;
#endif

#ifdef USE_TRAFFIC_LIGHT_LEDS
#include "TrafficLight.hpp"
std::vector<TrafficLight> trafficLightLeds{};
#endif

#ifdef USE_REMOTE_GPIOS
#include "RemoteGpio.hpp"
std::vector<RemoteGpio> remoteGpios{};
#endif

#ifdef USE_KY025
const int digitalPinReedContact = 19;

long reedContactCounter = 0;
unsigned long lastRotationMillis = 0;
double oldRpm = -1.0;
double rpm = 0.0;
#endif

#ifdef USE_HB0014
const int digitalPinInfraredLed = 34;
int digitalValueInfrared = 0; // digital readings
int digitalValueOldInfrared = 0;
unsigned long lastMillisInfrared = millis();
#endif

#ifdef USE_OLED_SSD1306
#include "./displays/SSD1306.hpp"
OledSsd1306Display *oled1306 = NULL;
#endif

#ifdef USE_LCD_160X
#include "./displays/LCDDisplay.hpp"
LcdDisplay *lcdDisplay = NULL;
#endif

#ifdef USE_KEYPAD
#include "ButtonMatrixHandling.hpp"
using namespace IotZoo;
IotZoo::ButtonMatrixHandling buttonMatrixHandling;
#endif

#ifdef ESP8266
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#else
#include <WiFi.h>
#endif

#ifdef USE_BUTTON
#include "ButtonHandling.hpp"
ButtonHandling buttonHandling;
#endif

#ifdef USE_SWITCH
#include "Switch.hpp"
std::vector<Switch> switches{};
#endif

// --------------------------------------------------------------------------------------------------------------------
// Global variables
// --------------------------------------------------------------------------------------------------------------------
String firmwareVersion = "0.1.3";

bool doRestart = false;
unsigned long aliveCounter = 0;
unsigned long lastAliveTime = 0;
unsigned long lastLoopStartTime = millis();

unsigned long lastServerAliveMillis = millis();
long loopCounter = 0;
long loopDurationMs = 0;

static const uint8_t LED_BUILTIN = 2;

// --------------------------------------------------------------------------------------------------------------------
// usings
// --------------------------------------------------------------------------------------------------------------------
using namespace std;
using namespace IotZoo;

String macAddress;

bool topicsRegistered = false;

/// @brief Restarts the microcontroller.
void restart()
{
  Serial.println("*** RESTART NOW!!! ***");
  ESP.restart();
}

/// @brief Get the MAC Address of the microcontroller.
/// @return
String getMacAddress()
{
  // It would be even possible to set the MAC address!
  macAddress = WiFi.macAddress();
  Serial.println("MAC: " + macAddress);
  return macAddress;
}

/// @brief Gets the board type of the microcontroller.
/// @return
String identifyBoard()
{
  // do not change because this is part of the MQTT topic. The MQTT topic is case sensitive!
#ifdef ARDUINO_ESP32_DEV
  return "esp32";
#else
  return "esp8266";
#endif
}

#ifdef USE_DS18B20
#include "DS18B20.hpp"
IotZoo::DS18B20 *ds18B20SensorManager = NULL;
#endif

#ifdef USE_MQTT
#undef USE_MQTT2
#endif

#ifdef USE_MQTT
#include "MqttClient.hpp"
MqttClient *mqttClient = NULL;
#endif

#ifdef USE_MQTT2
#include "MqttClient2.hpp"
MqttClient *mqttClient = NULL;
#endif

#ifdef USE_TM1637_4

#include "./displays/TM1637/TM1637_4_Handling.hpp"
IotZoo::TM1637_4_Handling tm1637_4Handling;
#endif

#ifdef USE_TM1637_6
#include "./displays/TM1637/TM1637_6_Handling.hpp"
IotZoo::TM1637_6_Handling tm1637_6Handling;
#endif

#if defined(USE_MQTT) || defined(USE_MQTT2)
const String NamespaceNameFallback = "iotzoo";
/// @brief Get the base MQTT Topic.
/// @return
String getBaseTopic()
{
  String namespaceName = settings->getNamespaceName(NamespaceNameFallback);
  if (namespaceName.length() > 0)
  {
    namespaceName += "/";
  }
  String projectName = settings->getProjectName(ProjectNameFallback);
  if (projectName.length() > 0)
  {
    projectName += "/";
  }
  // Serial.println("baseTopic: " + projectName + identifyBoard() + "/" + macAddress);

  return namespaceName + projectName + identifyBoard() + "/" + macAddress;
}

void publishError(const String &errMsg)
{
  String topic = getBaseTopic() + "/error";
  mqttClient->publish(topic, errMsg);
}

#endif

#ifdef USE_REMOTE_GPIOS
void onReceivedDataRemoteGpio(const String &rawData, int index)
{
  auto remoteGpio = remoteGpios.begin();
  std::advance(remoteGpio, index);
  Serial.println("Remote Gpio index " + String(index) + ", GPIO Pin: " + remoteGpio->getGpioPin());

  remoteGpio->handlePayload(rawData);
}

