HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
void onReceivedDataRemoteGpio0(const String &rawData)
{
  Serial.println("onReceivedDataRemoteGpio0: " + rawData);
  onReceivedDataRemoteGpio(rawData, 0);
}

void onReceivedDataRemoteGpio1(const String &rawData)
{
  onReceivedDataRemoteGpio(rawData, 1);
}

void onReceivedDataRemoteGpio2(const String &rawData)
{
  onReceivedDataRemoteGpio(rawData, 2);
}

void onReceivedDataRemoteGpio3(const String &rawData)
{
  onReceivedDataRemoteGpio(rawData, 3);
}

void onReceivedDataRemoteGpio4(const String &rawData)
{
  onReceivedDataRemoteGpio(rawData, 4);
}

#endif

void onReceivedConnectedDevicesConfiguration(const String &json)
{
  Serial.println("*** onReceivedConfiguration ***");
  Serial.println(json);
  settings->saveConfiguration(json);
}

bool onReceivedMicrocontrollerConfiguration(const String &json)
{
  try
  {
    Serial.println("*** onReceivedMicrocontrollerConfiguration (via MQTT): " + json);
    Serial.println(json);
    if (json.length() == 0)
    {
      return false;
    }
    StaticJsonDocument<400> jsonDocument;

    DeserializationError error = deserializeJson(jsonDocument, json);
    if (error)
    {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.f_str());
    }
    String namespaceName = jsonDocument["NamespaceName"].as<String>();
    String projectName = jsonDocument["ProjectName"].as<String>();
    String ipMqttBroker = jsonDocument["IpMqttBroker"].as<String>();
    bool ok0 = settings->setNamespaceName(namespaceName);
    bool ok1 = settings->setProjectName(projectName);
    bool ok2 = settings->setMqttBrokerIp(ipMqttBroker);
    if (ok0 && ok1 && ok2)
    {
      Serial.println("Successful saved settings");
      return true;
    }
  }
  catch (const std::exception &e)
  {
    Serial.println(e.what());
  }
  return false;
}

#ifdef USE_HW040
IotZoo::HW040Handling hw040Handling;
#endif

#if defined(USE_MQTT) || defined(USE_MQTT2)

String serializeTopic(const Topic &topic)
{
  StaticJsonDocument<512> doc;
  doc["Topic"] = topic.TopicName;
  // doc["ProjectName"] = settings.getProjectName(ProjectNameFallback); // is included in microcontroller
  doc["Description"] = topic.Description;
  doc["Persist"] = topic.Persist;            // Persist false: Do not insert in table topic_history.
  doc["MessageDirection"] = topic.Direction; // From the perspective of the IotZooClient.
  String jsonTopic;
  size_t size = serializeJson(doc, jsonTopic);
  // Serial.println("Serialized topic " + jsonTopic + " size: " + String(size) + " bytes.");
  return jsonTopic;
}

String serializeMicrocontroller()
{
  Microcontroller microcontroller;
  microcontroller.MacAddress = macAddress;
  microcontroller.IpAddress = WiFi.localIP().toString();
  microcontroller.IpMqttBroker = settings->getMqttBrokerIp(MqttBrokerIpFallback);
  microcontroller.BoardType = identifyBoard();
  microcontroller.ProjectName = settings->getProjectName(ProjectNameFallback);
  microcontroller.NamespaceName = settings->getNamespaceName("iotzoo");
  microcontroller.FirmwareVersion = firmwareVersion;
  StaticJsonDocument<256> doc;
  doc["NamespaceName"] = microcontroller.NamespaceName;
  doc["ProjectName"] = microcontroller.ProjectName;
  doc["BoardType"] = microcontroller.BoardType;
  // doc["Description"] = microcontroller.Description;
  doc["IpAddress"] = microcontroller.IpAddress;
  doc["MacAddress"] = microcontroller.MacAddress;
  doc["IpMqttBroker"] = microcontroller.IpMqttBroker;
  doc["FirmwareVersion"] = microcontroller.FirmwareVersion;
  doc["MicrocontrollerType"] = identifyBoard();
  String json;
  size_t size = serializeJson(doc, json);
  // Serial.println("Serialized topic " + json + " size: " + String(size) + " bytes.");
  return json;
}

void AddMicrocontrollerNestedJsonObject(JsonDocument *jsonDocument)
{
  JsonObject jsonObjectMicrocontroller = jsonDocument->createNestedObject("Microcontroller");
  jsonObjectMicrocontroller["MacAddress"] = WiFi.getHostname();
  jsonObjectMicrocontroller["IpAddress"] = WiFi.localIP();
  jsonObjectMicrocontroller["ProjectName"] = settings->getProjectName(ProjectNameFallback);
  jsonObjectMicrocontroller["FirmwareVersion"] = firmwareVersion;
  jsonObjectMicrocontroller["BoardType"] = identifyBoard();
}

void AddAliveNestedJsonObject(JsonDocument *jsonDocument)
{
  JsonObject jsonObjectAlive = jsonDocument->createNestedObject("Alive");
  jsonObjectAlive["AliveCounter"] = aliveCounter;
  jsonObjectAlive["LoopCounter"] = loopCounter;
  jsonObjectAlive["LoopDurationMs"] = loopDurationMs;
  jsonObjectAlive["ReconnectionCount"] = mqttClient->getConnectionEstablishedCount() - 1;
  jsonObjectAlive["AliveIntervalMs"] = settings->getAliveIntervalMillis();
}

void AddSupportedDevicesNestedJsonObject(JsonDocument *jsonDocument)
{
  JsonObject jsonObjectSupportedDevices = jsonDocument->createNestedObject("SupportedDevices");
#ifdef USE_HW040
  jsonObjectSupportedDevices["HW-040"] = true;
#else
  jsonObjectSupportedDevices["HW-040"] = false;
#endif
#ifdef USE_KEYPAD
  jsonObjectSupportedDevices["KeyPad"] = true;
#else
  jsonObjectSupportedDevices["KeyPad"] = false;
#endif
#ifdef USE_REMOTE_GPIOS
  jsonObjectSupportedDevices["REMOTE_GPIOS"] = true;
#else
  jsonObjectSupportedDevices["REMOTE_GPIOS"] = false;
#endif
#ifdef USE_TRAFFIC_LIGHT_LEDS
  jsonObjectSupportedDevices["TRAFFIC_LIGHT_LEDS"] = true;
#else
  jsonObjectSupportedDevices["TRAFFIC_LIGHT_LEDS"] = false;
#endif
#ifdef USE_DS18B20
  jsonObjectSupportedDevices["DS18B20"] = true;
#else
  jsonObjectSupportedDevices["DS18B20"] = false;
#endif
#ifdef USE_WS2818
  jsonObjectSupportedDevices["WS2818"] = true;
#else
  jsonObjectSupportedDevices["WS2818"] = false;
#endif
#ifdef USE_BUTTON
  jsonObjectSupportedDevices["BUTTON"] = true;
#else
  jsonObjectSupportedDevices["BUTTON"] = false;
#endif
#ifdef USE_SWITCH
  jsonObjectSupportedDevices["SWITCH"] = true;
#else
  jsonObjectSupportedDevices["SWITCH"] = false;
#endif
#ifdef USE_TM1637_4
  jsonObjectSupportedDevices["TM1637_4"] = true;
#else
  jsonObjectSupportedDevices["TM1637_4"] = false;
#endif
#ifdef USE_TM1637_6
  jsonObjectSupportedDevices["TM1637_6"] = true;
#else
  jsonObjectSupportedDevices["TM1637_6"] = false;
#endif
#ifdef USE_LED_AND_KEY
  jsonObjectSupportedDevices["TM1638LedAndKey"] = true;
#else
  jsonObjectSupportedDevices["TM1638LedAndKey"] = false;
#endif
#ifdef USE_LCD_160X
  jsonObjectSupportedDevices["LCD160x"] = true;
#else
  jsonObjectSupportedDevices["LCD160x"] = false;
#endif
#ifdef USE_HC_SR501
  jsonObjectSupportedDevices["HC-SR501"] = true;
#else
  jsonObjectSupportedDevices["HC-SR501"] = false;
#endif
#ifdef USE_REST_SERVER
  jsonObjectSupportedDevices["RestServer"] = true;
#else
  jsonObjectSupportedDevices["RestServer"] = false;
#endif
#ifdef USE_BLE_HEART_RATE_SENSOR
  jsonObjectSupportedDevices["BleHeartRate"] = true;
#else
  jsonObjectSupportedDevices["BleHeartRate"] = false;
#endif
}

