HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
void pushTopicToIotZooClient(const Topic &topic)
{
  String jsonTopic = serializeTopic(topic);
  String topicRegisterKnownTopic = getBaseTopic() + "/register_known_topic";

  mqttClient->publish(topicRegisterKnownTopic, jsonTopic);
}

void pushTopicsToIotZooClient(std::vector<Topic> &topics)
{
  Serial.println("*** register_microcontroller:");
  String topicRegisterMicrocontroller = getBaseTopic() + "/register_microcontroller";

  String jsonMicrocontroller = serializeMicrocontroller();
  jsonMicrocontroller.remove(jsonMicrocontroller.length() - 1);
  jsonMicrocontroller += ", \"KnownTopics\": [";

  int size = topics.size();
  if (size > 64) // We are limited to 16 kb. This is the set buffer size of the MQTT client. If this size is exceeded, the message will not be delivered.
  {
    Serial.println("sorry, to much data. We are limited to 16 kb.");
    size = 64;
  }

  topics.begin();

  for (int index = 0; index < size; index++)
  {
    auto topic = topics.begin();
    std::advance(topic, index);

    String jsonTopic = serializeTopic(*topic);

    if (index != size - 1)
    {
      jsonTopic += ",\r\n";
    }

    jsonMicrocontroller += jsonTopic;
  }
  jsonMicrocontroller += "] }";

  Serial.println(jsonMicrocontroller);
  if (mqttClient->publish(topicRegisterMicrocontroller,
                          jsonMicrocontroller,
                          false)) // retain should be false
  {
    Serial.println("Known Topics successfully sent to the IOTZOO client.");
  }
  else
  {
    publishError("Unable to send topic " + topicRegisterMicrocontroller);
  }

  if (topics.size() > 64)
  {
    Serial.println("Forwarding the remaining topics");
    for (int index = 64; index < topics.size(); index++)
    {
      auto topic = topics.begin();
      std::advance(topic, index);

      pushTopicToIotZooClient(*topic);
    }
  }
}

void publishDeviceConfigurations()
{
  try
  {
    String topicDevices = getBaseTopic() + "/device_config";
    String deviceConfiguration = settings->loadConfiguration();
    Serial.println("publishing device configuration: " + deviceConfiguration);
    mqttClient->publish(topicDevices, deviceConfiguration);
  }
  catch (const std::exception &e)
  {
    Serial.println(e.what());
  }
}

void publishErrorMessage(const String &errorMessage)
{
  String topicError = getBaseTopic() + "/error";
  mqttClient->publish(topicError, errorMessage);
}

/// @brief Create Json for alive message.
/// @return Json for alive message
String createAliveJson()
{
  StaticJsonDocument<4096> jsonDocument; // on stack
  // DynamicJsonDocument jsonDocument(4096); // on heap

  AddMicrocontrollerNestedJsonObject(&jsonDocument);
  AddAliveNestedJsonObject(&jsonDocument);
  AddSupportedDevicesNestedJsonObject(&jsonDocument);

  String json;
  serializeJson(jsonDocument, json);
  return json;
}
#endif

// ------------------------------------------------------------------------------------------------
// Periodically send an alive message.
// ------------------------------------------------------------------------------------------------

#if defined(USE_MQTT) || defined(USE_MQTT2)
void publishAliveMessage()
{
  Serial.println("publishAliveMessage");

  aliveCounter++;
  String topicAlive = getBaseTopic() + "/alive";
  String json = createAliveJson();
  mqttClient->publish(topicAlive, json);

  lastAliveTime = millis();
}


/// @brief IotZoo acknowledged the alive message.
/// @param rawData 
void onAliveAck(const String &rawData)
{
  if (rawData.length() > 0)
  {
    if (rawData != "0")
    {
      digitalWrite(LED_BUILTIN, HIGH); // turn the LED on.
    }
    Serial.println("Received alive_ack: " + rawData + ", millis: " + String(millis()));

    lastServerAliveMillis = millis();
  }
}

// --------------------------------------------------------------------------------------------------------------------
/// @brief /esp32/<mac>/status requested (from IoTZooClient) via MQTT.
/// @param rawData

void onStatusRequested(const String &status)
{
  Serial.println("*** Status requested: " + status);
  if (status == "device_config")
  {
    publishDeviceConfigurations();
  }
  else if (status == "alive")
  {
    publishAliveMessage();
  }
  else
  {
    publishErrorMessage("Do not know what status you want: " + status);
  }
}

#ifdef USE_MQTT2
/// @brief /esp32/<mac>/status requested (from IoTZooClient) via MQTT.
void onStatusRequested2(char *topic, byte *payload, unsigned int length)
{
  Serial.println("Received " + String(topic));
  // Convert the payload into a String
  payload[length] = '\0';
  String rawData((char *)payload);
  rawData.toLowerCase();
  onStatusRequested(rawData);
}

#endif

#endif

#ifdef USE_WS2818
/// @brief Example: esp32/08:D1:F9:E0:31:78/neo/0/setPixelColorRGB
/// @param json
void setPixelColorRGB(const String &json)
{
  Serial.println("setPixelColorRGB rawData: " + String(json)); // {"r": 0, "g": 125, "b": 0, "index": 15, "length": 1, "brightness": 33}
  u_int8_t r;
  u_int8_t g;
  u_int8_t b;
  u_int16_t startIndex;
  u32_t length = 1;
  u_int8_t brightness;

  StaticJsonDocument<200> jsonDocument;

  DeserializationError error = deserializeJson(jsonDocument, json);
  if (error)
  {
    publishError("deserializeJson() of '" + String(json) + "' failed: " + String(error.f_str()));
  }

  r = jsonDocument["r"].as<u_int8_t>();
  g = jsonDocument["g"].as<u_int8_t>();
  b = jsonDocument["b"].as<u_int8_t>();
  startIndex = jsonDocument["index"].as<u_int16_t>();
  brightness = jsonDocument["brightness"].as<u32_t>();

  length = jsonDocument["length"].as<u32_t>();
  if (length < 1)
  {
    length = 1;
  }

  Serial.println("setPixelColor r: " + String(r) + ", g: " + String(g) + ", b, " + String(b) + ", startIndex: " + String(startIndex) + ", brightness: " + brightness + ", length: " + String(length));

  if (NULL != ws2812)
  {
    for (u_int16_t index = startIndex; index < startIndex + length; index++)
    {
      ws2812->setPixelColorRGB(r, g, b, index, brightness);
    }
  }
}

/// @brief Example: esp32/08:D1:F9:E0:31:78/neo/0/setPixelColor
/// @param json
void setPixelColor(const String &json)
{
  Serial.println("setPixelColor rawData: " + String(json)); // {"color": 1106052, "index": 15, "length": 1, "brightness": 33}
  u_int32_t color;

  u_int16_t startIndex;
  u_int16_t length = 1;
  u_int8_t brightness;

  StaticJsonDocument<200> jsonDocument;

  DeserializationError error = deserializeJson(jsonDocument, json);
  if (error)
  {
    publishError("deserializeJson() of '" + String(json) + "' failed: " + String(error.f_str()));
  }

  color = jsonDocument["color"].as<u_int32_t>();

  startIndex = jsonDocument["index"].as<u_int16_t>();
  brightness = jsonDocument["brightness"].as<u32_t>();

  length = jsonDocument["length"].as<u_int16_t>();
  if (length < 1)
  {
    length = 1;
  }

  Serial.println("setPixelColor color: " + String(color) + ", startIndex: " + String(startIndex) + ", brightness: " + brightness + ", length: " + String(length));

