HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
  if (NULL != ws2812)
  {
    for (u_int16_t index = startIndex; index < startIndex + length; index++)
    {
      ws2812->setPixelColor(color, index, brightness);
    }
  }
}

/// @brief Example: esp32/08:D1:F9:E0:31:78/neo/0/setPixelColor
/// @param json
void setPixelColorHex(const String &json)
{
  Serial.println("setPixelColorHex rawData: " + String(json)); // {"color": "0x10E084", "index": 15, "length": 1, "brightness": 33}
  String colorHex;

  u_int16_t startIndex;
  u_int16_t length = 1;
  u_int8_t brightness;

  StaticJsonDocument<200> jsonDocument;

  DeserializationError error = deserializeJson(jsonDocument, json);
  if (error)
  {
    publishError("deserializeJson() of '" + String(json) + "' failed: " + String(error.f_str()));
  }

  colorHex = jsonDocument["color"].as<String>();
  if (colorHex.startsWith("#"))
  {
    colorHex = colorHex.substring(1);
  }

  startIndex = jsonDocument["index"].as<u_int16_t>();
  brightness = jsonDocument["brightness"].as<u32_t>();

  length = jsonDocument["length"].as<u_int16_t>();
  if (length < 1)
  {
    length = 1;
  }

  u_int32_t color = stoi(colorHex.c_str(), 0, 16);

  Serial.println("setPixelColor colorHex: " + String(colorHex) + ", color: " + String(color) + ", startIndex: " + String(startIndex) + ", brightness: " + brightness + ", length: " + String(length));

  if (NULL != ws2812)
  {
    for (u_int16_t index = startIndex; index < startIndex + length; index++)
    {
      ws2812->setPixelColor(color, index, brightness);
    }
  }
}

void subscribeNeoPixel(int index)
{
  String topic = getBaseTopic() + "/neo/" + String(index) + "/setPixelColorRGB";
  mqttClient->subscribe(topic, setPixelColorRGB);
  Serial.println("LED strip subscribed to topic " + topic);

  topic = getBaseTopic() + "/neo/" + String(index) + "/setPixelColor";
  mqttClient->subscribe(topic, setPixelColor);
  Serial.println("LED strip subscribed to topic " + topic);

  topic = getBaseTopic() + "/neo/" + String(index) + "/setPixelColorHex";
  mqttClient->subscribe(topic, setPixelColorHex);
  Serial.println("LED strip subscribed to topic " + topic);
}
#endif

// ------------------------------------------------------------------------------------------------
// Is called when MQTT connection is established.
// ------------------------------------------------------------------------------------------------

#ifdef USE_MQTT
void onConnectionEstablished() // do not rename! This method name is forced in EspMQTTClient.h. I do not like this.
{
  Serial.println("onMqttConnectionEstablished! baseTopic: " + getBaseTopic());

  String topicDeviceStatus = getBaseTopic() + "/status";
  mqttClient->subscribe(topicDeviceStatus, onStatusRequested);
  mqttClient->subscribe(macAddress + "/status", onStatusRequested);
  mqttClient->subscribe(getBaseTopic() + "/alive_ack", onAliveAck);

#ifdef USE_LCD_160X
  if (NULL != lcdDisplay)
  {
    lcdDisplay->onMqttConnectionEstablished();
  }
#endif

#ifdef USE_WS2818
  // It seems that the library only supports one light strip!
  if (NULL != ws2812)
  {
    ws2812->setup();
    subscribeNeoPixel(0);
  }
  else
  {
    Serial.println("ws2812 is NULL!");
  }

#endif

#ifdef USE_HW040
  hw040Handling.onMqttConnectionEstablished(mqttClient, getBaseTopic());
#endif

#ifdef USE_STEPPER_MOTOR
  if (NULL != stepperMotor)
  {
    stepperMotor->onMqttConnectionEstablished();
  }
#endif

#ifdef USE_REMOTE_GPIOS
  int indexRemoteGpio = 0;
  Serial.println("REMOTE GPIO's ");

  if (0 == remoteGpios.size())
  {
    Serial.println("no remote GPIO's!");
  }

  Serial.println("Count of configured remote gpio's: " + String(remoteGpios.size()));

  for (auto &remoteGpio : remoteGpios)
  {
    String topicRemoteGpio = getBaseTopic() + "/gpio/" + indexRemoteGpio;

    Serial.println("Subscribe Topic " + topicRemoteGpio + " Remote Gpio Pin: " + remoteGpio.getGpioPin());

    if (0 == indexRemoteGpio)
    {
      mqttClient->subscribe(topicRemoteGpio,
                            onReceivedDataRemoteGpio0,
                            1); // QoS
    }
    else if (1 == indexRemoteGpio)
    {
      mqttClient->subscribe(topicRemoteGpio,
                            onReceivedDataRemoteGpio1,
                            1); // QoS
    }
    else if (2 == indexRemoteGpio)
    {
      mqttClient->subscribe(topicRemoteGpio,
                            onReceivedDataRemoteGpio2,
                            1); // QoS
    }
    else if (3 == indexRemoteGpio)
    {
      mqttClient->subscribe(topicRemoteGpio,
                            onReceivedDataRemoteGpio3,
                            1); // QoS
    }
    else if (4 == indexRemoteGpio)
    {
      mqttClient->subscribe(topicRemoteGpio,
                            onReceivedDataRemoteGpio4,
                            1); // QoS
    }
    indexRemoteGpio++;
  }

#endif

#ifdef USE_OLED_SSD1306
  if (NULL != oled1306)
  {
    oled1306->onMqttConnectionEstablished();
  }
#endif

#ifdef USE_STEPPER_MOTOR
  if (NULL != stepperMotor)
  {
    stepperMotor->onMqttConnectionEstablished();
  }
#endif

#ifdef USE_BUTTON
  buttonHandling.onMqttConnectionEstablished();
#endif

#ifdef USE_TM1637_4
  tm1637_4Handling.onMqttConnectionEstablished(mqttClient, getBaseTopic());
#endif

#ifdef USE_TM1637_6
  tm1637_6Handling.onMqttConnectionEstablished(mqttClient, getBaseTopic());
#endif

#ifdef USE_LED_AND_KEY
  if (NULL != tm1638)
  {
    tm1638->onMqttConnectionEstablished();
  }
#endif

#ifdef USE_TRAFFIC_LIGHT_LEDS
  for (auto &trafficLight : trafficLightLeds)
  {
    trafficLight.onMqttConnectionEstablished();
  }
#endif

  String topicReboot = getBaseTopic() + "/system";

  mqttClient->subscribe(topicReboot, [=](const String &payload)
                        {
  if (payload == "reboot")
  {
    restart();
  } });

  String topicIntervalAlive = getBaseTopic() + "/alive_interval_ms";
  mqttClient->subscribe(topicIntervalAlive, [=](const String &payload)
                        {
    settings->setAliveIntervalMillis(std::stol(payload.c_str()));
    Serial.println("alive interval is changed to " + String(settings->getAliveIntervalMillis())); });

