HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
  // Save the device configurations.
  String topicSetDeviceConfiguration = getBaseTopic() + "/save_device_config";
  mqttClient->subscribe(topicSetDeviceConfiguration, [=](const String &payload)
                        {
    Serial.println("Received device configurations -> Save it."); 
    onReceivedConnectedDevicesConfiguration(payload);
    restart(); });

  // Save the project configurations.
  String topicSetMicrocontrollerConfiguration = macAddress + "/save_microcontroller_config"; // macAddress instead of getBaseTopic()!
  mqttClient->subscribe(topicSetMicrocontrollerConfiguration, [=](const String &payload)
                        {
                          if (payload.length())
                          {
                            Serial.println("Received topic + " + topicSetMicrocontrollerConfiguration + " -> save the microcontroller configuration.");
                            if (onReceivedMicrocontrollerConfiguration(payload))
                            {
                              // Remove retained message from the server
                              mqttClient->removeRetainedMessageFromBroker(topicSetMicrocontrollerConfiguration);
                              delay(1000);
                              restart();
                            }
                          } });
}

#endif

/**
 * @brief Loads the configuration for the connected devices and instantiates them.
 */
void makeInstanceConfiguredDevices()
{
  Serial.println("Loading configuration and instantiate devices...");

  String jsonDeviceConfigurations = settings->loadConfiguration();
  if (0 == jsonDeviceConfigurations.length())
  {
    Serial.println("Not yet configured!");
  }
  else // if (jsonDeviceConfigurations.length() > 0)
  {
    Serial.println("Config: " + jsonDeviceConfigurations);
    DynamicJsonDocument jsonDocument(4096);

    DeserializationError error = deserializeJson(jsonDocument, jsonDeviceConfigurations);
    if (error)
    {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.f_str());
    }
    JsonArray arrDevices = jsonDocument.as<JsonArray>();

    for (JsonVariant value : arrDevices)
    {
      String deviceType = value["DeviceType"];
      int deviceIndex = value["DeviceIndex"];
      bool isEnabled = value["IsEnabled"];

      Serial.println("DeviceName: '" + deviceType + "', IsEnabled: " + String(isEnabled));

      if (isEnabled)
      {
        JsonArray arrPins = value["Pins"].as<JsonArray>();
        JsonArray arrProperties = value["PropertyValues"].as<JsonArray>();

#ifdef USE_BUTTON
        if (deviceType == "Button")
        {
          int buttonPin = arrPins[0]["MicrocontrollerGpoPin"];

          buttonHandling.addDevice(mqttClient, getBaseTopic(), deviceIndex, buttonPin);

          Serial.println("Button initialized.");
        }
#endif

#ifdef USE_SWITCH
        if (deviceType == "Switch")
        {
          int switchPin = arrPins[0]["MicrocontrollerGpoPin"];

          Switch *switchBtn = new Switch(deviceIndex, mqttClient, getBaseTopic(), switchPin);
          switches.push_back(*switchBtn);
          Serial.println("Switch initialized.");
        }
#endif

#ifdef USE_KEYPAD
        if (deviceType == "Keypad 4x4")
        {
          int column3Pin = arrPins[0]["MicrocontrollerGpoPin"];
          int column2Pin = arrPins[1]["MicrocontrollerGpoPin"];
          int column1Pin = arrPins[2]["MicrocontrollerGpoPin"];
          int column0Pin = arrPins[3]["MicrocontrollerGpoPin"];
          int row0Pin = arrPins[4]["MicrocontrollerGpoPin"];
          int row1Pin = arrPins[5]["MicrocontrollerGpoPin"];
          int row2Pin = arrPins[6]["MicrocontrollerGpoPin"];
          int row3Pin = arrPins[7]["MicrocontrollerGpoPin"];

          ButtonMatrix *buttonMatrix = new ButtonMatrix(mqttClient, deviceIndex, getBaseTopic());
          buttonMatrix->setRowPins(row0Pin, row1Pin, row2Pin, row3Pin);
          buttonMatrix->setColPins(column0Pin, column1Pin, column2Pin, column3Pin);

          buttonMatrixHandling.AddDevice(buttonMatrix);

          Serial.println("Buttonmatrix initialized.");
        }
#endif

#ifdef USE_STEPPER_MOTOR
        if (deviceType == "28BY48Stepper")
        {
          int pin1 = arrPins[0]["MicrocontrollerGpoPin"];
          int pin2 = arrPins[1]["MicrocontrollerGpoPin"];
          int pin3 = arrPins[2]["MicrocontrollerGpoPin"];
          int pin4 = arrPins[3]["MicrocontrollerGpoPin"];

          stepperMotor = new StepperMotor(mqttClient, deviceIndex, getBaseTopic(), pin1, pin2, pin3, pin4);

          Serial.println("28BY48 Stepper initialized.");
        }
#endif

#ifdef USE_HC_SR501
        // Add 1..3 HC-SR501 motion detectors.
        if (deviceType == "HC-SR501")
        {
          int pinMotionDetector = arrPins[0]["MicrocontrollerGpoPin"];
          motionDetectorsHrsc501Handling.addDevice(deviceIndex, mqttClient, getBaseTopic(), pinMotionDetector);
        }
#endif

#ifdef USE_LCD_160X
        // Add USE_LCD_160X display.
        if (deviceType == "LCD160x")
        {
          Serial.println("Initializing LCD160x display.");
          uint8_t columns = 20;
          uint8_t rows = 4;
          uint8_t i2cAddress = 0x27;
          for (JsonVariant property : arrProperties)
          {
            String propertyName = property["Name"];
            String propertyValue = property["Value"];

            if (propertyName == "Columns")
            {
              columns = std::stoi(propertyValue.c_str());
            }
            else if (propertyName == "Rows")
            {
              columns = std::stoi(propertyValue.c_str());
            }
            else if (propertyName == "I2CAddress")
            {
              i2cAddress = std::stoi(propertyValue.c_str());
            }
          }

          lcdDisplay = new LcdDisplay(i2cAddress, // set the LCD address to 0x27
                                      columns,
                                      rows, deviceIndex, mqttClient, getBaseTopic());

          Serial.println("LCD160x configuration added! I2C-Address: " + String(i2cAddress));
        }
#endif // USE_LCD_160X

#ifdef USE_OLED_SSD1306

        // SDA must be connected to pin 21 and SCL to pin 22.
        if (deviceType == "OLED_SSD1306")
        {
          Serial.println("Initializing OLED_SSD1306 display.");
          // u_int8_t sclPin = arrPins[0]["MicrocontrollerGpoPin"];
          // u_int8_t sdaPin = arrPins[1]["MicrocontrollerGpoPin"];
          u_int8_t i2cAddress = 0x3C;

          oled1306 = new OledSsd1306Display(i2cAddress, deviceIndex, mqttClient, getBaseTopic());
          Serial.println("Oled display SSD1306 initialized! I2C-Address: " + String(i2cAddress));
        }
#endif // USE_OLED_SSD1306

#ifdef USE_DS18B20
        if (deviceType == "DS18B20")
        {
          // Add 1 DS18B20 temperature sensors manager which can support 1..64 DS18B20 temperature sensors.
          ds18B20SensorManager = new IotZoo::DS18B20();

          int datPin = arrPins[0]["MicrocontrollerGpoPin"];

          int transmissionInterval = 20000;
          int resolution = 11;

          for (JsonVariant property : arrProperties)
          {
            String propertyName = property["Name"];
            String propertyValue = property["Value"];
            if (propertyName == "Interval")
            {
              transmissionInterval = std::stoi(propertyValue.c_str());
            }
            else if (propertyName == "Resolution")
            {
              resolution = std::stoi(propertyValue.c_str());
            }
            if (transmissionInterval < 5000)
            {
              transmissionInterval = 5000;
            }
            if (transmissionInterval > 900000) // 15 min
            {
              transmissionInterval = 900000;
            }
            if (resolution < 9)
            {
              resolution = 9;
            }
            if (resolution > 11)
            {
              resolution = 11;
            }
          }

          ds18B20SensorManager->setup(datPin, resolution, transmissionInterval);

          Serial.println("DS18B20 sensors configuration loaded! Dat Pin is " + String(datPin) + ", Resolution: " +
                         String(resolution) + ", Transmission interval: " + String(transmissionInterval));
        }
#endif
#ifdef USE_WS2818
        if (deviceType == "NEO" || deviceType == "Neo Pixel")
        {
          Serial.println("Configuration of NEO pixels...");
          int dioPin = arrPins[0]["MicrocontrollerGpoPin"];
          int numberOfLeds = 256;

          for (JsonVariant property : arrProperties)
          {
            String propertyName = property["Name"];
            String propertyValue = property["Value"];
            if (propertyName == "numberOfLeds")
            {
              numberOfLeds = std::stoi(propertyValue.c_str());
            }
          }

          ws2812 = new WS2818(dioPin, numberOfLeds);

