HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
          hw040Handling.addDevice(mqttClient, getBaseTopic(), deviceIndex,
                                  boundaryMinValue,
                                  boundaryMaxValue,
                                  circleValues,
                                  acceleration,
                                  encoderSteps,
                                  clkPin, dtPin, swPin, -1);
          Serial.println("HW-040 rotary encoder initialized! CLK Pin is " + String(clkPin) +
                         ", DT Pin is " + String(dtPin) +
                         ", MS Pin is " + String(swPin) +
                         ", boundaryMinValue is " + String(boundaryMinValue) +
                         ", boundaryMaxValue is " + String(boundaryMaxValue) +
                         ", acceleration is " + String(acceleration) +
                         ", circleValues is " + String(circleValues) +
                         ", encoderSteps is " + String(encoderSteps));
        }
#endif
      }
    }
  }
  Serial.println("Configuration is loaded");
}

#if defined(USE_REST_SERVER)
#if defined(USE_MQTT) || defined(USE_MQTT2)
void handleGetAlive()
{
  Serial.println("Get alive");
  String json = createAliveJson();
  webServer.send(200, "application/json", json.c_str());
}
#endif
#endif

#ifdef USE_REST_SERVER
/// @brief http get delivers the configuration of the connected sensors/devices. http://raspberrypi/deviceConfig
void handleGetDeviceConfig()
{
  Serial.println("GET device config");
  String json = settings->loadConfiguration();
  webServer.send(200, "application/json", json.c_str());
}

/// @brief
/// @param index Index of the GPIO pin.
/// @return State of the GPIO pin at Index @see index.
void handleGetGpioState(int index)
{
#ifdef USE_REMOTE_GPIOS
  auto remoteGpio = remoteGpios.begin();
  std::advance(remoteGpio, index);
  int data = remoteGpio->readDigitalValue();
  Serial.println("GPIO Pin " + String(remoteGpio->getGpioPin()) + " is in state " + String(data));
  webServer.send(200, "text/plain", String(data));
#endif
}

void handleGetGpio0State()
{
  handleGetGpioState(0);
}

void handleGetGpio1State()
{
  handleGetGpioState(1);
}

void handleGetGpio2State()
{
  handleGetGpioState(2);
}

void handleGetGpio3State()
{
  handleGetGpioState(3);
}

void handleGetGpio4State()
{
  handleGetGpioState(4);
}

#ifdef USE_REST_SERVER

/// @brief Blazor app sends device config.
void handlePostDeviceConfig()
{
  Serial.println("Received device config (POST).");
  if (webServer.hasArg("plain") == false)
  {
    // handle error here
    Serial.println("rest problem");
  }
  String body = webServer.arg("plain");
  settings->saveConfiguration(body);
  Serial.println(body);
  // Respond to the client
  webServer.send(200, "application/json", "{}");
}

/// @brief Blazor app sends microcontroller config.
void handlePostMicrocontrollerConfig()
{
  Serial.println("Received microcontroller config (POST).");

  if (webServer.hasArg("plain") == false)
  {
    // handle error here
    Serial.println("rest problem");
  }
  String body = webServer.arg("plain");
  Serial.println(body);
  // JSON data buffer
  DynamicJsonDocument jsonDocument(1024); // on heap
  deserializeJson(jsonDocument, body);

  String mqttBrokerIp = jsonDocument["IpMqttBroker"];
  String projectName = jsonDocument["ProjectName"];
  String namespaceName = jsonDocument["NamespaceName"];

  Serial.println("MqttBrokerIp: " + mqttBrokerIp);
  Serial.println("Project: " + projectName);
  if (!settings->setMqttBrokerIp(mqttBrokerIp))
  {
    Serial.println("MqttBrokerIp not saved!");
  }
  if (!settings->setNamespaceName(namespaceName))
  {
    Serial.println("NamespaceName not saved!");
  }
  if (!settings->setProjectName(projectName))
  {
    Serial.println("ProjectName not saved!");
  }
  // Respond to the client
  webServer.send(200, "application/json", "{}");

  doRestart = true;
}

#endif

void connectToWiFi()
{
  Serial.print("Connecting to ");
  Serial.println(ssid);

  WiFi.begin(ssid, password);

  while (WiFi.status() != WL_CONNECTED)
  {
    Serial.print("+");
    delay(200);
  }

  WiFi.setAutoReconnect(true);

  Serial.print("Connected. IP: ");
  Serial.println(WiFi.localIP());
  Serial.println("AutoReconnect: " + String(WiFi.getAutoReconnect()));
}
#endif

#ifdef USE_BLE_HEART_RATE_SENSOR
/// @brief Callback from the heart rate sensor (heart rate changed)
/// @param pBLERemoteCharacteristic
/// @param pData heartRate/Pulse
/// @param length
/// @param isNotify
void notifyCallbackHeartRate(NimBLERemoteCharacteristic *pBLERemoteCharacteristic,
                             uint8_t *data,
                             size_t length,
                             bool isNotify)
{
  if (data[1] > 0)
  {
    Serial.println("Pulse: " + String(data[1]));
  }

#ifdef USE_EXERCISE_BIKE_STANDALONE
#ifdef USE_TM1637_4
  auto displayPulse = displays1637_4.begin();
  displayPulse->showNumber(data[1]);
#endif
#endif

#if defined(USE_MQTT) || defined(USE_MQTT2)
  String topic = getBaseTopic() + "/pulse/0";
#ifdef USE_KY025
  if (rpm > 54.5 && rpm < 56)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_55";
  }
  else if (rpm > 59.5 && rpm < 61)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_60";
  }
  else if (rpm > 64.5 && rpm < 66)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_65";
  }
  else if (rpm > 69.5 && rpm < 71)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_70";
  }
  else if (rpm > 74.5 && rpm < 76)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_75";
  }
  else if (rpm > 79.5 && rpm < 81)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_80";
  }
  else if (rpm > 84.5 && rpm < 86)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_85";
  }
  else if (rpm > 89.5 && rpm < 91)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_90";
  }
  else if (rpm > 94.5 && rpm < 96)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_95";
  }
  else if (rpm > 99.5 && rpm < 100)
  {
    topic = getBaseTopic() + "/pulse/0/pulse_rpm_100";
  }

#endif
  mqttClient->publish(topic.c_str(), String(data[1]).c_str()); // Pulse
#endif
}
#endif

