HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#ifdef USE_KY025
void IRAM_ATTR isr()
{
  // Serial.print("1"); // crashes!!!

  int diff = millis() - lastRotationMillis;
  if (diff > 300.0)
  {
    reedContactCounter++;
    oldRpm = rpm;
    rpm = 1.0 / (diff / 60000.0);
  }
  lastRotationMillis = millis();
}
#endif

#ifdef USE_BLE_HEART_RATE_SENSOR
void connectToHeartRateSensor()
{
  int timeOut = 90;
  String topic = getBaseTopic() + "/pulse/0/scan_started";
#ifdef USE_MQTT2
  mqttClient->publish(topic, "BLE scan started to find advertising heart rate sensor. Timeout is set to " + String(timeOut) + " s.");
#endif
  heartRateMonitor.setup(notifyCallbackHeartRate, // Callback method, called on heart rate received
                         timeOut);                // Scan duration
}

#endif

// ------------------------------------------------------------------------------------------------
void setup()
{
  Serial.begin(115200);
  Serial.println("*** SETUP ***");
  pinMode(LED_BUILTIN, OUTPUT);
  settings = new Settings();
  randomSeed(micros());

  macAddress = getMacAddress();

  // helps if the config is destroyed ...
  /*
    nvs_flash_erase(); // erase the NVS partition and...
    nvs_flash_init(); // initialize the NVS partition.
    Serial.println("Flash is now empty.");
    while(true);
  */

#if defined(USE_REST_SERVER)
  connectToWiFi();
  // Routing REST Server

  // REST interface
#if defined(USE_MQTT) || defined(USE_MQTT2)
  webServer.on("/alive", HTTP_GET, handleGetAlive);
#endif
  webServer.on("/deviceConfig", HTTP_GET, handleGetDeviceConfig);
  webServer.on("/deviceConfig", HTTP_POST, handlePostDeviceConfig);
  webServer.on("/microcontrollerConfig", HTTP_POST, handlePostMicrocontrollerConfig);
  webServer.on("/gpio/0", HTTP_GET, handleGetGpio0State);
  webServer.on("/gpio/1", HTTP_GET, handleGetGpio1State);
  webServer.on("/gpio/2", HTTP_GET, handleGetGpio2State);
  webServer.on("/gpio/3", HTTP_GET, handleGetGpio3State);
  webServer.on("/gpio/4", HTTP_GET, handleGetGpio4State);
  webServer.begin();
#endif

#ifdef USE_TM1637_4
  tm1637_4Handling.setup();
#endif

#ifdef USE_TM1637_6
  tm1637_6Handling.setup();
#endif

#if defined(USE_MQTT) || defined(USE_MQTT2)
  char *mqttClientName = new char[18]();

  for (int i = 0; i < 17; i++)
  {
    mqttClientName[i] = macAddress[i];
  }

  String strMqttBrokerIp = settings->getMqttBrokerIp(MqttBrokerIpFallback);
  Serial.println("MQTT Broker Ip: " + strMqttBrokerIp);
  char *mqttBrokerIp = new char[18]();
  for (int i = 0; i < 17; i++)
  {
    mqttBrokerIp[i] = strMqttBrokerIp[i];
  }

  mqttClient = new MqttClient(mqttClientName, ssid, password, mqttBrokerIp, NULL, NULL, 1883);

  Serial.println("BaseTopic: " + getBaseTopic());
#ifdef USE_MQTT2
  mqttClient->setup(macAddress);

  String topicDeviceStatus = getBaseTopic() + "/status";
  mqttClient->subscribe(topicDeviceStatus, onStatusRequested2, 0);
#endif

#endif

  makeInstanceConfiguredDevices();

#ifdef USE_BLE_HEART_RATE_SENSOR
  connectToHeartRateSensor();
#endif

  lastAliveTime = millis() - settings->getAliveIntervalMillis();

#ifdef USE_KY025
  pinMode(digitalPinReedContact, INPUT_PULLUP);
  attachInterrupt(digitalPinReedContact, isr, FALLING);
#endif

#ifdef USE_HB0014
  pinMode(digitalPinInfraredLed, INPUT);
#ifdef USE_OLED_SSD1306
  setTextLine(1, "?");
  setTextLine(2, "Watt");
#endif
#endif
}

#ifdef USE_MQTT

void publishViaMqtt(const String &topicName, const String &payload)
{
  Serial.println(topicName);
  Serial.println(payload);
  mqttClient->publish(topicName, payload);
}
#endif

#ifdef USE_DS18B20
void loopDS18B20()
{
  if (NULL != ds18B20SensorManager)
  {
    std::list<float> temperatures = ds18B20SensorManager->requestTemperatures();

    int index = 0;

    for (const auto &temperature : temperatures)
    {
      if (millis() - ds18B20SensorManager->getLastPublishedTemperatureMillis() > ds18B20SensorManager->getInterval())
      {
        String topic = getBaseTopic() + "/ds18b20_manager/0/sensor/" + String(index) + "/celsius";

        Serial.print(topic + "/" + String(temperature));
        Serial.println(" ºC");
        if (temperature > -55 && temperature < 125)
        {
          mqttClient->publish(topic, String(temperature, 1));
          ds18B20SensorManager->setLastPublishedTemperatureMillis(millis());
        }
      }
      index++;
    }
  }
}
#endif

/// @brief Register all from this microcontroller supported topics at the IOTZOO client.
void registerTopics()
{
#ifdef USE_MQTT
  Serial.println("Register Known Topics at the IOTZOO client.");

  String lastWillTopic = getBaseTopic() + "/terminated";
  mqttClient->enableLastWillMessage(lastWillTopic.c_str(), "SHUTDOWN", 0);

  // so now the IOTZOO client knows this microcontroller.
  // ... let's tell it more about the connected devices and what you can do with it...

  std::vector<Topic> topics{};

  topics.push_back(*new Topic(getBaseTopic() + "/register_microcontroller",
                              "Registers all the known topics of the microcontroller. Microcontroller started.",
                              MessageDirection::IotZooClientInbound));

  // necessary? register_microcontroller should be enough.
  topics.push_back(*new Topic(getBaseTopic() + "/started",
                              "Microcontroller started",
                              MessageDirection::IotZooClientInbound));

  // Alive message of the microcontroller
  topics.push_back(*new Topic(getBaseTopic() + "/alive",
                              "Alive message of the microcontroller",
                              MessageDirection::IotZooClientInbound));

  // Acknowledge fo the alive message from the IotZooClient.
  topics.push_back(*new Topic(getBaseTopic() + "/alive_ack",
                              "Alive message of the microcontroller",
                              MessageDirection::IotZooClientOutbound));

  topics.push_back(*new Topic(getBaseTopic() + "/terminated",
                              "Microcontroller terminated!",
                              MessageDirection::IotZooClientInbound));

