HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#ifdef USE_BLE_HEART_RATE_SENSOR
  topics.push_back(*new Topic(getBaseTopic() + "/pulse/0",
                              "heart rate of heart rate monitor 0.",
                              MessageDirection::IotZooClientInbound));
#endif

#ifdef USE_STEPPER_MOTOR
  if (NULL != stepperMotor)
  {
    stepperMotor->addMqttTopicsToRegister(&topics);
  }
#endif

#ifdef USE_BUTTON
  buttonHandling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_SWITCH
  for (auto &buttonSwitch : switches)
  {
    buttonSwitch.addMqttTopicsToRegister(&topics);
  }
#endif

#ifdef USE_LCD_160X
  if (NULL != lcdDisplay)
  {
    lcdDisplay->addMqttTopicsToRegister(&topics);
  }
#endif

#ifdef USE_OLED_SSD1306
  if (NULL != oled1306)
  {
    oled1306->addMqttTopicsToRegister(&topics);
  }
#endif

#ifdef USE_TM1637_4
  tm1637_4Handling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_TM1637_6
  tm1637_6Handling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_HW040
  hw040Handling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_HC_SR501

  motionDetectorsHrsc501Handling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_LED_AND_KEY
  if (NULL != tm1638)
  {
    tm1638->addMqttTopicsToRegister(&topics);
  }
#endif

#ifdef USE_KEYPAD
  buttonMatrixHandling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_DS18B20
  if (NULL != ds18B20SensorManager)
  {
    Serial.println("Register temperature sensors.");
    // std::list<float> temperatures = ds18B20SensorManager->requestTemperatures();
    int index = 0;
    // for (auto &temperature : temperatures)
    for (int index = 0; index < 10; index++)
    {
      topics.push_back(*new Topic(getBaseTopic() + "/ds18b20_manager/0/sensor/" + String(index) + "/celsius",
                                  "The Temperature in °C of Sensor " + String(index),
                                  MessageDirection::IotZooClientInbound));
    }
  }
#endif

#ifdef USE_WS2818
  topics.push_back(*new Topic(getBaseTopic() + "/neo/0/setPixelColorRgb",
                              "{\"r\": 0, \"g\": 125, \"b\": 0, \"index\": 15, \"length\": 1, \"brightness\": 35}",
                              MessageDirection::IotZooClientOutbound));

  topics.push_back(*new Topic(getBaseTopic() + "/neo/0/setPixelColorHex",
                              "{\"color\": \"#10E084\" \"index\": 0, \"length\": 10, \"brightness\": 10}",
                              MessageDirection::IotZooClientOutbound));

  topics.push_back(*new Topic(getBaseTopic() + "/neo/0/setPixelColor",
                              "{\"color\": \"1106052\" \"index\": 0, \"length\": 10, \"brightness\": 10}",
                              MessageDirection::IotZooClientOutbound));
#endif

#ifdef USE_TRAFFIC_LIGHT_LEDS
  for (auto &trafficLight : trafficLightLeds)
  {
    trafficLight.addMqttTopicsToRegister(&topics);
  }
#endif

  pushTopicsToIotZooClient(topics);
#endif // USE_MQTT
  topicsRegistered = true;
}

/// @brief Called when the IotZoo Client has not responded to the alive message.
void onIotZooClientUnavailable()
{
  Serial.println("*** IoT-Zoo client is unavailable! Please start it! ***");

  String jsonMicrocontroller = serializeMicrocontroller();

  mqttClient->publish("i_am_lost", jsonMicrocontroller);
  // server dead?
#ifdef USE_TM1637_4
  tm1637_4Handling.onIotZooClientUnavailable();
#endif

#ifdef USE_TM1637_6
  tm1637_6Handling.onIotZooClientUnavailable();
#endif

#ifdef USE_LED_AND_KEY
  if (NULL != tm1638)
  {
    tm1638->onIotZooClientUnavailable();
  }
#endif // USE_LED_AND_KEY

#ifdef USE_OLED_SSD1306
  if (NULL != oled1306)
  {
    oled1306->onIotZooClientUnavailable();
  }
#endif

#ifdef USE_LCD_160X
  if (NULL != lcdDisplay)
  {
    lcdDisplay->onIotZooClientUnavailable();
  }
#endif

#ifdef USE_STEPPER_MOTOR
  if (NULL != stepperMotor)
  {
    stepperMotor->onIotZooClientUnavailable();
  }
#endif
}

// ------------------------------------------------------------------------------------------------
// The loop.
// ------------------------------------------------------------------------------------------------
void loop()
{
  loopCounter++;
  if (doRestart)
  {
    restart();
  }

  // Serial.println("LOOP " + String(loopCounter) + ", millis: " + millis());

#ifdef USE_BLE_HEART_RATE_SENSOR
  heartRateMonitor.loop();
#endif

#ifdef USE_BUTTON
  buttonHandling.loop();
#endif

#ifdef USE_SWITCH
  for (auto &buttonSwitch : switches)
  {
    buttonSwitch.loop();
  }
#endif

#ifdef USE_LED_AND_KEY
  if (NULL != tm1638)
  {
    tm1638->loop();
  }
#endif // USE_LED_AND_KEY

#ifdef USE_KY025
  if (millis() - lastRotationMillis < 10000)
  {
    Serial.println(reedContactCounter);
  }

#ifdef USE_TM1637_4
  TM1637 *tm1637 = tm1637_4Handling.getDisplayByDeviceIndex(2);
  if (NULL != tm1637)
  {
    tm1637->showNumber(reedContactCounter, true);
  }
#if defined(USE_MQTT) || defined(USE_MQTT2)
  String topic = getBaseTopic() + "/rpm/0";
  if (rpm > 0)
  {
    Serial.println(String(rpm) + " rpm");
  }
  mqttClient->publish(topic.c_str(), String(rpm, 0).c_str());
#endif
#endif // USE_KY025

#ifdef USE_EXERCISE_BIKE_STANDALONE
  if (millis() - lastRotationMillis > 3000)
  {
    rpm = 0.0;
  }

#ifdef USE_TM1637_4
  auto displayRpm = tm1637_4Handling.displays1637.begin();
  std::advance(displayRpm, 1);
  // displayRpm->showNumber(reedContactCounter);
  displayRpm->showNumber((int)rpm);
#endif
#endif

#if defined(USE_MQTT) || defined(USE_MQTT2)
  if (oldRpm != rpm)
  {
    String topic = getBaseTopic() + "/reed_contact_counter/0";
    mqttClient->publish(topic.c_str(), String(reedContactCounter).c_str());
  }
#endif

#endif

  lastLoopStartTime = millis();

#ifdef USE_REST_SERVER
  webServer.handleClient();
#endif

#ifdef USE_MQTT2
  if (!mqttClient->isConnected())
  {
    mqttClient->connectToBroker(macAddress);
  }
#endif

#if defined(USE_MQTT) || defined(USE_MQTT2)

  mqttClient->loop();
  if (millis() - lastLoopStartTime > 2000)
  {
    Serial.print("BROKEN MQTT");
    restart();
  }
  if (!mqttClient->isConnected())
  {
    Serial.print(".");
    delay(50);
    return;
  }

