HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
  // >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
  // The preconditions are fulfilled (MQTT connected).

#ifdef USE_HW040
  hw040Handling.loop();
#endif

#ifdef USE_STEPPER_MOTOR
  if (NULL != stepperMotor)
  {
    stepperMotor->loop();
  }
#endif

#ifdef USE_DS18B20
  loopDS18B20();
#endif // USE_DS18B20

  if (!topicsRegistered)
  {
    registerTopics();
    String topic = getBaseTopic() + "/started";
    mqttClient->publish(topic, "STARTED");
  }
#endif

#ifdef USE_HB0014
  digitalValueInfrared = digitalRead(digitalPinInfraredLed);
  // Serial.println(String(millis()) + " Reed contact: " + String(digitalValueReedContact));
  if (digitalValueInfrared == HIGH && digitalValueOldInfrared == LOW)
  {
    long diff = millis() - lastMillisInfrared;
#ifdef USE_OLED_SSD1306
    setTextLine(3, String(diff) + " ms");
#endif
    if (diff > 30)
    {
      // Umrechnen in Watt

      // 10000 Impulse entsprechen 1 KW/h.

      // Hochrechnen auf 10000 Impulse = 1000 Watt pro Stunde
      double watt = 360000.0 / diff;
      Serial.println(String(watt) + " watt");
#ifdef USE_OLED_SSD1306
      setTextLine(1, String(watt, 0));
#endif
      String topic = getBaseTopic() + "/power/0";
      mqttClient->publish(topic, String(watt, 0));
      lastMillisInfrared = millis();
    }
  }
  digitalValueOldInfrared = digitalValueInfrared;
#endif

#ifdef USE_KEYPAD
  buttonMatrixHandling.loop();
#endif

#ifdef USE_HC_SR501
  motionDetectorsHrsc501Handling.loop();
#endif
#if defined(USE_MQTT) || defined(USE_MQTT2) && !defined(USE_BLE_HEART_RATE_SENSOR)
  try
  {
    if (millis() - lastAliveTime > settings->getAliveIntervalMillis())
    {
      publishAliveMessage();
    }
  }
  catch (const std::exception &e)
  {
    Serial.println(e.what()); // Exception handling does only work with build_flags -DPIO_FRAMEWORK_ARDUINO_ENABLE_EXCEPTIONS
  }
#endif

  loopDurationMs = millis() - lastLoopStartTime;

  if (millis() - lastServerAliveMillis > (settings->getAliveIntervalMillis() * 2))
  {
    onIotZooClientUnavailable();
    lastServerAliveMillis = millis();
  }

  if (loopDurationMs < 100)
  {
    delay(100 - loopDurationMs);
  }
  digitalWrite(LED_BUILTIN, LOW); // turn the LED off to indicate that the device is offline.
}

// --- end of main.cpp ----------------------------------------------------------------------------------------------------------
